<?php

use App\Models\Question;
use Illuminate\Database\Seeder;

class QuestionSeeder extends Seeder
{
	/**
	 * Run the database seeds.
	 *
	 * @return void
	 */
	public function run()
	{
		DB::table('questions')->insert([
			'question_ru' => 'Как купить фейерверк в магазине Piston Киев',
			'question_uk' => 'Як купити феєрверк в інтернет-магазині Piston в Києві',
			'answer_ru'   => 'Купить фейерверк можно позвонив по телефону 093-775-14-89 - VIBER. А также оформив заказ через корзину сайта. ',
			'answer_uk'   => 'Купити феєрверк можна через корзину сайту, або зателефонувавши на номер 093-775-14-89. Також, Ви можете зробити замовлення написавши нам на VIBER, Telegram',
			'is_home'     => '1',
		]);
		DB::table('questions')->insert([
			'question_ru' => 'Сколько стоят фейерверки и салюты в магазине Piston в Киеве и Украине?',
			'question_uk' => 'Скільки коштують феєрверки в інтернет-магазині Piston в Києві і Україні',
			'answer_ru'   => 'Цена на фейерверки и салюты находится в диапазоне от 110 грн до 16000 грн. На стоимость влияет количество выстрелов и калибр зарядов. Чем больше выстрелов и больше калибр тем дороже фейерверк',
			'answer_uk'   => 'Ціна на феєрверки та салюти знаходиться в діапазоні від 110 грн до 16000 грн. На вартість впливає кількість пострілів і калібр зарядів. Чим більше пострілів і більше калібр тим дорожче феєрверк.',
			'is_home'     => '1',
		]);
		$question = Question::create([
			'question_ru' => 'Как заказать холодные фонтаны?',
			'question_uk' => 'Як замовити холодні фонтани?',
			'answer_ru'   => 'Заказать запуск холодных фонтанов можно по тел. 093-775-14-89, уточнить какие фонтаны запускаем, адрес локации, время прибытия. ',
			'answer_uk'   => 'Замовити запуск холодних фонтанів можна за тел. 093-775-14-89, уточнити які фонтани запускаємо, адреса локації, час прибуття.',
			'is_category' => '1',
		]);
		DB::table('question_category')->insert([
			'question_id' => $question->id,
			'category_id' => '4'
		]);

	}
}
