<?php

return [
    'login' => [
        'title' => 'Авторизація',
        'if_not_registered' => 'Якщо Ви ще не зареєстровані, то перейдіть на сторінку :link Реєстрації :endlink',
        'login' => 'E-Mail або телефон',
        'password' => 'Пароль',
        'enter' => 'Ввійти'
    ],
    'register' => [
        'title' => 'Реєстрація',
        'if_registered' => 'Якщо Ви вже зареєстровані то перейдіть на сторінку :link Авторизації :endlink',
        'name' => 'Ваше імя',
        'phone' => 'Номер телефону',
        'email' => 'E-Mail',
        'password' => 'Пароль',
        'password_confirm' => 'Повторіть пароль',
        'enter' => 'Зареєструватись',
        'success_message' => 'Ви вдало зареєструвались!'
    ],
    'validation' => [
        'name' => [
            'min' => 'Мінімум 2 символи.',
            'max' => 'Максимум 64 символи.',
            'required' => 'Імя обовязкове до заповнення.'
        ],
        'email' => [
            'email' => 'E-Mail не коректний.',
            'max' => 'Максимум 64 символи.',
            'unique' => 'Такий E-Mail зайнятий.'
        ],
        'password' => [
            'min' => 'Мінімальна довжина паролю 8 символів.',
            'max' => 'Максимальна довжина паролю 32 символи.',
            'confirmed' => 'Паролі не співпадають.'
        ],
        'phone' => 'Такий номер телефону вже зайнятий.'
    ],
    'auth' => [
        'login' => 'Такого телефону або E-Mail не знайдено.',
        'password' => 'Пароль не вірний.'
    ],
    'profile' => [
        'title' => 'Профіль',
        'orders' => 'Мої замовлення',
        'order' => 'Замовлення №:id'
    ]
];
